Autodesk.Revit.Attributes.TransactionMode.Automatic
The API framework will create a transaction on the active document before the external command is executed
and the transaction will be committed or rolled back after the command is completed (based upon the return value of
the ExternalCommand callback).
Remarks:  A command with this transaction mode should not be associated to a command visible when there is no active document.
The command will not be permitted to be started.